nc: 4  # number of classes
names: [tail-biting, ear-biting, belly-nosing, tail-down]

depth_multiple: 0.33  # model depth multiplier
width_multiple: 0.50  # layer width multiplier

anchors:
  - [10,13, 16,30, 33,23]      # P3/8
  - [30,61, 62,45, 59,119]     # P4/16
  - [116,90, 156,198, 373,326] # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 3, Bottleneck, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 6, Bottleneck, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 6, Bottleneck, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 3, Bottleneck, [1024]],
   [-1, 1, SPPF, [1024, 5]]]

head:
  [[-1, 1, Detect, [nc]]]